#include "message.H"

#ifdef	_FOR_KOREA
char	*g_strMessage[]	=	
{
//	0~5
	"붉은 보석 시작 에러!!",
	"해당 주소에서 화일을 다운 받을 수 없습니다.",
	"작업 취소",
	"작업을 취소 하시겠습니까?",
	"다운로드중",
	"설치 시간",

//	6~10
	"전송 속도",
	"프로그램 실행 에러!!",
	"",
	"게임이 설치된 폴더를 찾을 수 없습니다.",
	"붉은 보석 시작 프로그램",

//	11~15
	"패치가 끝나면 확인 버튼을 눌러 주시기 바랍니다.",
	"붉은 보석 시작 프로그램",
	"패치 정보를 찾을 수 없습니다.",
	"붉은 보석의 레지스트리 정보를 찾을 수 없습니다.",
	"게임이 설치된 폴더를 찾을 수 없습니다.",

//	16~20
	"다음 화일을 찾을 수 없습니다.\n\n%s",
	"※ 게임정보 확인중",
	"※ 버전정보를 확인 중입니다.",
	"※ 패치 데이터를 전송 받는 중입니다.",
	"게임 실행",

//	21~25
	"※ 작업이 모두 완료 되었습니다.",
	"다운로드 완료",
	"※ 업데이트 작업이 완료 되었습니다.",
	"※ 업데이트 할 데이터가 없습니다.",
	"다음 폴더를 찾을 수 없습니다.\n\n%s",

//	26~30
	"업데이트 작업이 취소되었습니다.",
	"※ 다운로드 받은 패치 데이터를 설치하는 중입니다.",
	"에러!!",
	"로그인 서버와 연결 할 수 없습니다. 잠시후에 다시 시도해 보시기 바랍니다.",
	"설치중",

};

#endif
