#include "message.H"

#ifdef	_FOR_JAPAN
char	*g_strMessage[]	=	
{
//	0~5
	"「RED STONE」スタートエラー！！",
	"該当アドレスからファイルのダウンロードができません。",
	"アップデートキャンセル",
	"アップデートをキャンセルしますか？",
	"ダウンロード中",
	"経過時間",

//	6~10
	"転送速度",
	"プログラム実行エラー！！",
	" ",
	"ゲームがインストールされているフォルダが見つかりません。",
	"「RED STONE」スタートプログラム",

//	11~15
	"パッチが終了したら、確認ボタンを押してください。",
	"「RED STONE」スタートプログラム",
	"更新情報が見つかりません。",
	"「RED STONE」のレジストリ情報が見つかりません。",
	"ゲームがインストールされているフォルダが見つかりません。",

//	16~20
	"次のファイルが見つかりません。\n\n%s",
	"※ ゲーム情報の確認中",
	"※ バージョン情報を確認中です。",
	"※ パッチデータをダウンロード中です。",
	"ゲーム実行",

//	21~25
	"※ ダウンロードがすべて完了しました。",
	"ダウンロード完了",
	"※ アップデートが完了しました。",
	"※ アップデートするファイルはありません。",
	"次のファイルが見つかりません。\n\n%s",

//	26~30
	"アップデートがキャンセルされました。",
	"※ ダウンロードしたパッチデータをインストール中です。",
	"エラー！！",
	"ログインサーバーに接続できません。しばらく経ってから接続してください。",
	"インストール中",

};
#endif
