#include "message.H"

#ifdef	_FOR_THAI
char	*g_strMessage[]	=	
{
	//	0~5
	"พบข้อผิดพลาดในการเริ่มเล่นเกม Red Stone!!",
	"ไม่สามารถทำการ Download ข้อมูลจากปลายทางนี้ได้",
	"ยกเลิกการติดตั้ง ",
	"คุณต้องการที่จะยกเลิกการติดตั้งใช่ไหม??",
	"กำลัง Download ข้อมูล",
	"เวลาที่ต้องการ",

	//	6~10
	"ความเร็วในการรับ-ส่งข้อมูล ",
	"พบข้อผิดพลาดในการเริ่มโปรแกรม!!",
	"ไม่พบข้อมูลเวอร์ชั่น ที่ติดตั้งในเครื่อง ",
	"ไม่พบ Folder ที่ทำการติดตั้งเกม",
	"เริ่มติตตั้งโปรแกรมเกม Red Stone",

	//	11~15
	"เมื่อติตตั้ง Patch สมบูรณ์แล้ว , ให้กดปุ่มยืนยัน ",
	"เริ่มเล่นเกม Red Stone",
	"ไม่พบข้อมูล Patch",
	"ไม่พบ Registry ของเกม Red Stone",
	"ไม่พบ Folder ของเกม",

	//	16~20
	"ไม่พบ file:\n\n%s",
	"- กำลังตรวจสอบข้อมูลเกม ",
	"- กำลังตรวจสอบเวอร์ชั่นของเกม ",
	"- กำลังรับข้อมูล patch",
	"เริ่มเกม",

	//	21~25
	"- การติดตั้งเสร็จสมบูรณ์แล้ว",
	"Download สมบูรณ์ ",
	"- Update สมบูรณ์ ",
	"- ไม่มีข้อมูลที่ต้อง Update เพิ่มเติม ",
	"ไม่พบโฟล์เดอร์:\n\n%s",

	//	26~30
	"การ Update ถูกยกเลิก ",
	"- กำลังติดตั้งข้อมูล patch",
	"พบข้อผิดพลาด!!",
	"ไม่สามารถเชื่อมต่อกับล็อกอินเซิร์ฟเวอร์ได้ กรุณารอสักครู่แล้วลองใหม่อีกครั้ง ",
	"กำลังทำการติดตั้ง ",
};

#endif
