#include "message.H"

#ifdef	_FOR_KOREA
char	*g_strMessage[]	=	
{
//	0~5
	"%s 제거",
	"언인스톨",
	"%s을 제거 합니다.",
	"언인스톨 중에 문제가 발생했습니다.",
	"레지스트리 정보를 찾을 수 없습니다.",
	"프로그램이 설치된 폴더를 찾을 수 없습니다.\n\n%s",

//	6~10
	"모든 화일을 제거 하였습니다.",
	"작업 중지",
	"작업이 완료되지 않았습니다. 지금 종료하면 프로그램이 정상적으로 제거되지 않습니다.\n\n\
프로그램 제거를 정상적으로 완료하기 위해서는 작업을 계속 해야 합니다.\n\n\
작업을 중지하시겠습니까?",
	"작업 완료",
	"프로그램 제거가 완료 되었습니다.",

	" ",
	"아래 폴더를 포함한 폴더 안에 모든 데이터가 제거 됩니다.\n\n 계속 하시겠습니까?\n\n\n[%s]",
	"레지스트리가 손상 되었습니다.",
	" 각종 레지스트리 정보가 삭제 되었습니다.\n\n 나머지 데이터는 수동으로 제거해야 합니다.",
	"프로그램 제거에 필요한 다음 화일을 찾을 수 없습니다.\n\n[%s]",

	" 이 프로그램은 %s을 컴퓨터에서 제거합니다.",
	" 계속 하시려면 제거 버튼을 누르시고 그만 하시려면 취소 버튼을 누르십시요.",
	"'%s' 화일 제거중.",
	"언인스톨 에러!!",
	"'Uninstall.dat'화일을 찾을 수 없습니다.",

	"붉은 보석"
};

#endif