#include "message.H"

#ifdef	_FOR_JAPAN

char	*g_strMessage[]	=	
{
//	0~5
	"%s √Ё",
	"лвллдллл?лы",
	"%sк√Ёкккбг",
	"лвллдллл?лыёщк┘¤Ёкм?цкккк┐бг",
	"льллллъя├кмк─клкъкккбг",
	"ллэллщлркмлдллл?лыккьккдкыллйлыл└кмк─клкъкккбг\n\n%s",

//	6~10
	"кк┘ккллблдлык√Ёкккк┐бг",
	"√Ёёщн",
	"√ЁкмшкккдкккбгЁ√ккыкбвллэллщлркяск√Ёккнкккбг\n\n\
ллэллщлрк√Ёкяскшккыккэ┬хк?к▒кк▒кькккъккк\n\n\
√Ёкёщнкккклг┐",
	"√Ёш",
	"ллэллщлрк√Ёкмшкккк┐бг",

	" ",
	"нкллйлыл└кксбвллйлыл└?ккк┘ккл?л┐км√Ёккьккбг\n\n ?к▒ккклг┐\n\n\n[%s]",
	"льллллъкмс┐кккдккбг",
	" └Ё·льллллъя├к√Ёккьккк┐ккбв?кък┴я√Ёкккпк└ккдбг",
	"ллэллщлр√Ёк▒щйк·▒?ллблдлыкмк─клкъкккбг\n\n[%s]",

	" к│кллэллщлрк%sкл│лллх?л┐?клкщ√Ёкккбг",
	" √Ёк?к▒кыэъкнклл┐лкбвлнлулллыккыэъклнлулллылл┐лкфукккпк└ккдбг",
	"'%s' ллблдлы√Ёёщ",
	"лвллдллл?лылилщ?гбгб",
	"'Uninstall.dat'ллблдлыкмк─клкъкккбг",

	"Red Stone",
};

#endif