#include "message.H"

#ifdef	_FOR_JAPAN

char	*g_strMessage[]	=	
{
//	0~5
	"%s の削除",
	"アンインストール",
	"%s をアンインストールします。",
	"アンインストール中にエラーが発生しました。",
	"レジストリ情報が見つかりません。",
	"プログラムがインストールされているフォルダが見つかりません。\n\n%s",

//	6~10
	"すべてのファイルを削除しました。",
	"処理を中止",
	"処理は完了していません。ここで終了すると、プログラムは正しく削除されません。\n\nアンインストールを完了するには、処理を続行してください。\n\nアンインストールを終了しますか？",
	"完了",
	"アンインストールが完了しました。",

	" ",
	"次のフォルダ内のすべてのデータとフォルダ自体を削除します。\n\n続行しますか？\n\n\n[%s]",
	"レジストリ情報が壊れています。",
	"一部のレジストリデータを削除しました。\n\n残りのデータは手動で削除してください。",
	"アンインストールに必要な次のファイルが見つかりません。\n\n[%s]",

	"このプログラムは、コンピュータから %s を削除します。",
	"削除を続行するには削除ボタンを、処理を中止するにはキャンセルボタンをクリックしてください。",
	"%s ファイルを削除中",
	"アンインストールエラーです。",
	"'Uninstall.dat'ファイルが見つかりません。",

	"Red Stone",
};

#endif
