#include "message.H"

#ifdef	_FOR_KOREA
char	*g_strMessage[]	=	
{
//	0~5

	" ",
	" ",
	" ",
	" ",
	" ",
	" ",

//	6~10
	" ",
	"설치가 완료되지 않았습니다. 지금 종료하면 프로그램이 정상적으로 설치 되지 않습니다.\n\n\
설치를 정상적으로 완료하기 위해서는 나중에 다시 설치 프로그램을 실행해야 합니다.\n\n\
설치를 그만 두시겠습니까?",
	"설치 종료",
	" ",
	" ",

//	11~15
	" ",
	" ",
	" ",
	"붉은 보석 패치",
	"붉은 보석 데이터를 패치 합니다.",

//	16~20
	"게임 설치 에러!!",
	"[%s] 폴더를 생성 할 수 없습니다.",
	"게임 폴더 : %s",
	"소요 시간 : %.2d분 %.2d초",
	"설치 속도",

//	21~25
	"작업 완료",
	"패치 작업이 모두 완료 되었습니다.",
	"붉은 보석",
	" ",
	" ",

//	26~30
	"현재 화일",
	"에러!!",
	"작업이 비정상적으로 종료 됐습니다.",
	"붉은 보석 설치.",
	"붉은 보석 클라이언트를 발견했습니다.",

//	31~35
	" ",
	" ",
	"패치 에러!!",
	"붉은 보석을 찾을 수 없습니다.",
	"이미 보다 높은 버젼의 클라이언트가 설치되어 있습니다.",

//	36~40
	"%d.%.4d버젼 이상의 클라이언트를 위한 패치입니다.",
	"궁서",
	"돋움체",
	"굴림",
	"%d.%.4d버젼 패치",

//	41~45
	" 이 프로그램은 붉은 보석 %d.%.4d 수동 패치입니다. 지금 실행중인 프로그램들을 모두 종료하시면 설치과정중에 발생할 수 있는 충돌을 최소화 할 수 있습니다.",
	" 계속 하시려면 [다음] 버튼을 누르시고 그만 하시려면 [취소] 버튼을 누르시기 바랍니다.",
	"- 붉은 보석의 패치 작업이 모두 완료 되었습니다.\n\n[게임 실행] 버튼을 누르시면 바로 게임이 실행 됩니다.",
	"- 작업을 끝내시려면 [완료] 버튼을 클릭하세요.",
};

#endif
