#include "message.H"

#ifdef	_FOR_JAPAN
char	*g_strMessage[]	=	
{
//	0~5

	" ",
	" ",
	" ",
	" ",
	" ",
	" ",

//	6~10
	" ",
	"インストールは完了していません。\n ここでプログラムを中止すると、追加/削除を要求したコンポーネントをインストール/アンインストールしません。\n\n\
後でインストールを実行して、処理を完了できます。\n\n\
インストールを中止してもよろしいですか？",
	"インストール終了",
	" ",
	" ",

//	11~15
	" ",
	" ",
	" ",
	"RED STONEパッチ",
	"  RED STONEのプログラムを更新します。",

//	16~20
	"ゲームインストールエラー！！",
	"[%s] フォルダを作成することができません。",
	"ゲームフォルダ : %s",
	"経過時間",
	"インストール速度",

//	21~25
	"更新完了",
	"  RED STONEの更新が完了しました。",
	"RED STONE",
	" ",
	" ",

//	26~30
	"現在ファイル",
	"エラー！！",
	"作業がキャンセルされました。",
	"RED STONE インストール",
	"RED STONEのクライアントが見つかりました。",

//	31~35
	" ",
	" ",
	"パッチエラー！！",
	" RED STONEが見つかりません。",
	"既に、最新バージョンのクライアントがインストールされています。",

//	36~40
	"%d.%.4dバージョン以上のクライアント用のパッチです。",
	"グンソ",
	"ドッウム体",
	"グリム",
	"%d.%.4dバージョンパッチ",

//	41~45
	" このプログラムは「RED STONE」 %d.%.4d 手動パッチです。現在実行中の他プログラムを終了しておきますと、インストール中に起こるエラーやインストール失敗の発生を少なくすることができます。",
	" インストールを続行する場合は「次へ」ボタンを、中止する場合は「キャンセル」ボタンを押してください。",
	"- 「RED STONE」のパッチインストール作業がすべて完了しました。\n\n「ゲーム開始」ボタンを押すと、ゲームが起動します。",
	"- 作業を終わらせる場合は「完了」ボタンを押してください。",
};
#endif